Dlubal.RFEM5.Solid
Solid parameters

Dlubal.RFEM5.Solid.No
Number

Dlubal.RFEM5.Solid.ID
Identifier

Dlubal.RFEM5.Solid.Comment
Comment

Dlubal.RFEM5.Solid.Tag
Tag

Dlubal.RFEM5.Solid.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.Solid.IsGenerated
Information if the object is generated or not (read only)

Dlubal.RFEM5.Solid.Type
Solid type

Dlubal.RFEM5.Solid.SurfaceList
Boundary surfaces list

Dlubal.RFEM5.Solid.MaterialNo
Material No.

Dlubal.RFEM5.Solid.Compound
Compound solid

Dlubal.RFEM5.Solid.Volume
Volume V (read only)

Dlubal.RFEM5.Solid.Weight
Weight W (read only)